app/controllers/hikingtrails_controller.rb

  def index
    hikingtrails = Hikingtrail.all
---
SELECT "hikingtrails".* FROM "hikingtrails"

  def show
    hikingtrail = Hikingtrail.find_by(id: params[:id])
---
SELECT "hikingtrails".* FROM "hikingtrails" WHERE "hikingtrails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @hikingtrail = Hikingtrail.create_or_find_by(hikingtrail_params)
---
INSERT INTO "hikingtrails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Skyline to the Sea Trail"], ["created_at", "2020-01-23 17:49:03.147080"], ["updated_at", "2020-01-23 17:49:03.147080"]]

  def find_trail
      @hikingtrail = Hikingtrail.find_by(id: params[:id])
---
SELECT "hikingtrails".* FROM "hikingtrails" WHERE "hikingtrails"."id" IS NULL LIMIT $1  [["LIMIT", 1]]