app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    tags = Tag.all

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    tag = Tag.find_by(id: params[:id])

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def find_tag
    tag = Tag.find_by(id: params[:id])