app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "m"], ["email", "m"], ["password", "m"], ["created_at", "2020-01-23 00:15:17.192195"], ["updated_at", "2020-01-23 00:15:17.192195"], ["username", "m"]]
---
  def create
      @user = User.create_or_find_by(user_params)